[
  {
    "sentences": [
      {
        "text": "In this video, I'm talking about how to get your first 100 customers for your SaaS product.",
        "start": 0.08,
        "end": 4.08
      },
      {
        "text": "I'm gonna be offering up actionable strategies and tactics on how you can get this done.",
        "start": 4.08,
        "end": 9.12
      },
      {
        "text": "I'm Rob Walling.",
        "start": 9.12,
        "end": 9.92
      },
      {
        "text": "I'm a startup founder with multiple exits, author of 3 books about building startups, and an investor in more than 100 companies.",
        "start": 9.92,
        "end": 16.735
      },
      {
        "text": "When most people think about building a product, they think about how can I build the product and then market it later?",
        "start": 16.735,
        "end": 22.015
      }
    ],
    "num_words": 80,
    "start": 0.08,
    "end": 22.015
  },
  {
    "sentences": [
      {
        "text": "How can I build something and then go find people who have this need?",
        "start": 22.015,
        "end": 25.695
      },
      {
        "text": "And that's the opposite way to go about it.",
        "start": 25.695,
        "end": 27.54
      },
      {
        "text": "If I were launching a product today, I would say finding your first 100 customers starts way before you write that first line of code.",
        "start": 27.54,
        "end": 34.36
      },
      {
        "text": "The first thing you should do is look for advantages that you have, and you do this when you're choosing the idea, before you write a line of code, before you choose the idea, before you validate the idea.",
        "start": 34.420002,
        "end": 45.005
      },
      {
        "text": "You think about, do I have an audience in any space that I could build a product for, or do I have a network in any space, a bunch of people who know me who I could call in to help do webinars, to co promote, to work that network to sell your product.",
        "start": 45.145,
        "end": 59.13
      }
    ],
    "num_words": 141,
    "start": 22.015,
    "end": 59.13
  },
  {
    "sentences": [
      {
        "text": "Now if you don't have an audience in a particular space, I'm a believer that if you're building a SaaS product, you don't need an audience because there are a bunch of traffic channels we're gonna talk about later that work without an audience, and the process of building an audience is actually quite time consuming.",
        "start": 59.13,
        "end": 73.545
      },
      {
        "text": "If you're gonna sell info products, if you're gonna sell courses, sure, having an audience is the way to go because people buy info products and courses from people they know, like, and trust.",
        "start": 73.545,
        "end": 81.16499
      },
      {
        "text": "However, building and selling a SaaS product, most people that I know who do it, they don't have an audience when they start.",
        "start": 81.56,
        "end": 87.88
      },
      {
        "text": "And in fact, they don't really build an audience as they're selling it.",
        "start": 87.88,
        "end": 90.439995
      },
      {
        "text": "If you have an audience, great.",
        "start": 90.439995,
        "end": 91.799995
      }
    ],
    "num_words": 132,
    "start": 59.13,
    "end": 91.799995
  },
  {
    "sentences": [
      {
        "text": "If you don't, I would not invest the time to build an audience before launching a SaaS product.",
        "start": 91.799995,
        "end": 96.505
      },
      {
        "text": "Now second, on the network, whether you have one or not, building a network that knows who you are and respects you as an entrepreneur, it's a big one.",
        "start": 96.505,
        "end": 104.265
      },
      {
        "text": "And that's something that I would start building.",
        "start": 104.265,
        "end": 106.025
      },
      {
        "text": "So whether you go to indiehackers.com, whether you go to microconfconnect, which is our Slack community, whether you go to the dynamite circle, there's so many online entrepreneur communities that I would be involved in if I didn't have any connections today and I wanted to start building a network of other like minded founders.",
        "start": 106.025,
        "end": 121.895004
      },
      {
        "text": "So if you find you have one of those two advantages, I would consider building a product in a way that can serve those spaces.",
        "start": 121.895004,
        "end": 128.715
      }
    ],
    "num_words": 135,
    "start": 91.799995,
    "end": 128.715
  },
  {
    "sentences": [
      {
        "text": "And if you don't, then this is where being a first time entrepreneur is challenging because you don't have a network and you don't have an audience and you just have to plunge in and start marketing before you start coding.",
        "start": 129.095,
        "end": 140
      },
      {
        "text": "That's the thing I want you to take away from this video is if you think that you're gonna go into a basement or you're gonna hire some developers, spend 6 to 12 months building out a product, and then go try to market it, you're thinking about it backwards because marketing and driving interest or having conversations with folks when you're looking at mock ups of a SaaS app, it helps you validate whether or not there is need for this product.",
        "start": 140,
        "end": 161.015
      },
      {
        "text": "So I'm a firm believer in having a landing page way before you start writing a line of code.",
        "start": 161.015,
        "end": 165.62
      },
      {
        "text": "I've done this with multiple SaaS apps.",
        "start": 165.76,
        "end": 167.84
      },
      {
        "text": "I've done this with a book.",
        "start": 167.84,
        "end": 169.62
      }
    ],
    "num_words": 156,
    "start": 129.095,
    "end": 169.62
  },
  {
    "sentences": [
      {
        "text": "I've done this with a conference.",
        "start": 169.84,
        "end": 171.29999
      },
      {
        "text": "I've done this with a startup accelerator.",
        "start": 171.43999,
        "end": 173.14
      },
      {
        "text": "All were landing pages before we had anything to speak of.",
        "start": 173.43999,
        "end": 176.79999
      },
      {
        "text": "And what I was trying to do was to validate whether there was interest or whether there was a need.",
        "start": 176.79999,
        "end": 181.885
      },
      {
        "text": "And the way that you do this is you set up this landing page where you're gonna capture emails and you're going to offer someone either updates on the launch or you offer them, you know, something to opt in.",
        "start": 182.105,
        "end": 191.705
      }
    ],
    "num_words": 84,
    "start": 169.84,
    "end": 191.705
  },
  {
    "sentences": [
      {
        "text": "But you basically say this is what we're building.",
        "start": 191.705,
        "end": 193.76001
      },
      {
        "text": "If you're interested in this and you're interested in the value that it provides in your email and we'll be in touch.",
        "start": 193.76001,
        "end": 198.88
      },
      {
        "text": "And what this does is allows you to build that email launch list which not only provides some validation that people are interested in the value that you're talking about, but it allows you to do what's called customer development, which is to have conversations as you have an idea about where this product should go.",
        "start": 198.88,
        "end": 212.175
      },
      {
        "text": "You get a 100 people, 500 people on that list.",
        "start": 212.175,
        "end": 214.815
      },
      {
        "text": "You can email 50 of them, and you can say, this is what I'm thinking of building.",
        "start": 214.815,
        "end": 218.575
      }
    ],
    "num_words": 114,
    "start": 191.705,
    "end": 218.575
  },
  {
    "sentences": [
      {
        "text": "These are the mock ups.",
        "start": 218.575,
        "end": 219.455
      },
      {
        "text": "Does this solve what the problem that I think it solves?",
        "start": 219.455,
        "end": 223.06999
      },
      {
        "text": "Does this provide value for you?",
        "start": 223.13,
        "end": 224.49
      },
      {
        "text": "Would you pay $30, $50, $100 a month for this product?",
        "start": 224.49,
        "end": 228.97
      },
      {
        "text": "And it allows you to start getting that validation that maybe people are interested.",
        "start": 228.97,
        "end": 232.75
      }
    ],
    "num_words": 47,
    "start": 218.575,
    "end": 232.75
  },
  {
    "sentences": [
      {
        "text": "To do this, you have to talk about your idea a lot, and you have to talk about your idea before it's done.",
        "start": 232.89,
        "end": 237.915
      },
      {
        "text": "So with the last SaaS app that I built, I got 11 people to tell me, yes, I would pay for this before we broke ground and wrote a line of code.",
        "start": 238.135,
        "end": 246.61499
      },
      {
        "text": "Your mileage may vary on this, but I was talking about my idea in public before we had code written.",
        "start": 246.61499,
        "end": 251.75
      },
      {
        "text": "My take on this is very few people, if any, are gonna steal your idea because ideas just they don't tend to be worth that much.",
        "start": 251.75,
        "end": 258.22998
      },
      {
        "text": "It's so much more about execution.",
        "start": 258.22998,
        "end": 260.41
      }
    ],
    "num_words": 107,
    "start": 232.89,
    "end": 260.41
  },
  {
    "sentences": [
      {
        "text": "I would recommend going on social media, podcasts if you can, asking people for advice, and you're trying to get product direction, but you're also trying to build up that interest list so that the day you launch is an amazing day of revenue.",
        "start": 260.55,
        "end": 272.83502
      },
      {
        "text": "That it's not that you launch and then you look for your first customer.",
        "start": 273.05502,
        "end": 275.93503
      },
      {
        "text": "It's that you launch to 10, 20, or 30 customers from day 1 because that provides that motivation and a little bit of revenue for you to keep going.",
        "start": 275.93503,
        "end": 284.13
      },
      {
        "text": "So let's say you followed this advice and you do have early interested customers.",
        "start": 284.13,
        "end": 288.55002
      },
      {
        "text": "You build the product.",
        "start": 288.61002,
        "end": 289.65
      }
    ],
    "num_words": 105,
    "start": 260.55,
    "end": 289.65
  },
  {
    "sentences": [
      {
        "text": "You get some people into early access, and and they're using it and you think it's time to launch this thing.",
        "start": 289.65,
        "end": 293.945
      },
      {
        "text": "So the first thing that I would do is launch to my email list, and that is where you give them a heads up 2 weeks in advance.",
        "start": 293.945,
        "end": 299.945
      },
      {
        "text": "You're kind of teasing the the product.",
        "start": 299.945,
        "end": 301.705
      },
      {
        "text": "You're saying, hey, these are the mock ups.",
        "start": 301.705,
        "end": 303.225
      },
      {
        "text": "This is what it looks like.",
        "start": 303.225,
        "end": 304.185
      }
    ],
    "num_words": 70,
    "start": 289.65,
    "end": 304.185
  },
  {
    "sentences": [
      {
        "text": "These are some screenshots.",
        "start": 304.185,
        "end": 305.165
      },
      {
        "text": "Here's a little cool video of what this product does.",
        "start": 305.225,
        "end": 308
      },
      {
        "text": "And usually, you give some type of launch motivation, whether that's free onboarding, free migration from a prior tool.",
        "start": 308,
        "end": 314
      },
      {
        "text": "Maybe you give a discount, although that's not necessarily my favorite way of doing it, but you let your email list know that they are getting something exclusive for having been on the email list and followed your journey.",
        "start": 314,
        "end": 324.20502
      },
      {
        "text": "And the idea is that that email launch list gets you your first 10, 20, 50 customers, and you work out the kinks.",
        "start": 324.20502,
        "end": 329.965
      }
    ],
    "num_words": 95,
    "start": 304.185,
    "end": 329.965
  },
  {
    "sentences": [
      {
        "text": "You fix the bugs that they encounter.",
        "start": 329.965,
        "end": 331.58502
      },
      {
        "text": "Maybe you build a few features that people are requesting, but you're basically getting prepared to launch to the world.",
        "start": 331.64502,
        "end": 338.58
      },
      {
        "text": "And this is what I call scratching and clawing.",
        "start": 338.81998,
        "end": 341.08
      },
      {
        "text": "I think Paul Graham said it better when he said do things that don't scale because launching to the world is often a one time event, and there's a lot of things that you can do in the short term that will get you customers that get you to that first 100 customer mark that won't take you to 500 or a 1000 customers.",
        "start": 341.13998,
        "end": 356.195
      },
      {
        "text": "So these are things like launching on Product Hunt, launching on Hacker News, doing a Reddit launch, going to q and a sites like Quora and Stack Exchange.",
        "start": 356.415,
        "end": 364.73502
      }
    ],
    "num_words": 128,
    "start": 329.965,
    "end": 364.73502
  },
  {
    "sentences": [
      {
        "text": "I've seen an entrepreneur build a SaaS app to $35,000 a month.",
        "start": 364.73502,
        "end": 369.62997
      },
      {
        "text": "So that's 35 k of MRR almost solely using Quora and Stack Exchange.",
        "start": 369.62997,
        "end": 374.21
      },
      {
        "text": "Maybe you do an AppSumo deal.",
        "start": 374.27,
        "end": 375.71
      },
      {
        "text": "Maybe you go on a podcast tour.",
        "start": 375.71,
        "end": 377.31
      },
      {
        "text": "These are all things that if you are good at them and you focus the time and you go out and learn how to do them.",
        "start": 377.31,
        "end": 383.275
      }
    ],
    "num_words": 64,
    "start": 364.73502,
    "end": 383.275
  },
  {
    "sentences": [
      {
        "text": "So product hunt launch for example, if you go to youtube.com/microconf, search for product hunt, you'll find that we have an entire 30 minute video on how to do a product hunt launch, and it is an interview and a talk from Derek Reimer who did this with SavvyCal, and he had great success launching on product hunt.",
        "start": 383.275,
        "end": 401.5
      },
      {
        "text": "And again, you're doing things that don't scale to get to that point of, at least I'm default to live.",
        "start": 401.5,
        "end": 406.7
      },
      {
        "text": "At least I have 5 ks or 10 ks a month in MRR because often that is a really difficult point to get to.",
        "start": 406.7,
        "end": 414.185
      },
      {
        "text": "It's the point that you get to where you can quit your day job.",
        "start": 414.185,
        "end": 417.705
      },
      {
        "text": "At this point, I wanna raise I think a common mistake that a lot of first time entrepreneurs make, and it's underpricing their product.",
        "start": 417.705,
        "end": 424.51
      }
    ],
    "num_words": 140,
    "start": 383.275,
    "end": 424.51
  },
  {
    "sentences": [
      {
        "text": "And it's thinking that if I only charge $5 per customer, I'm gonna get a lot more customers.",
        "start": 424.57,
        "end": 429.15002
      },
      {
        "text": "The problem is you get a 100 customers, $5 a month, you're only making $500 a month, and that's not enough to do much with.",
        "start": 429.29,
        "end": 436.97
      },
      {
        "text": "What if I charged $100 a month?",
        "start": 436.97,
        "end": 438.66498
      },
      {
        "text": "What could I build that's worth $100 a month?",
        "start": 438.66498,
        "end": 440.50497
      },
      {
        "text": "Then by the time you get to that 100 customer mark, you have 10 ks in MRR, and that allows you to, in most places in the world, quit that day job.",
        "start": 440.50497,
        "end": 448.905
      }
    ],
    "num_words": 91,
    "start": 424.57,
    "end": 448.905
  },
  {
    "sentences": [
      {
        "text": "Your price point dictates a lot more than you realize early on in your product.",
        "start": 448.905,
        "end": 454
      },
      {
        "text": "And so if you have a $5 a month versus $500 a month, you can barely do anything.",
        "start": 454,
        "end": 458.24
      },
      {
        "text": "You can do some Quora and Reddit and some content and SEO, but you can't afford to do pay per click ads versus if you have a price point of a 100 or $500 a month, you can afford to do a whole swath of marketing approaches.",
        "start": 458.24,
        "end": 470.80502
      },
      {
        "text": "If you followed the advice I've given you so far, you may already be at a 100 customers.",
        "start": 470.86502,
        "end": 475.20502
      },
      {
        "text": "But if you're not, then you have to start thinking about how do I build a marketing flywheel?",
        "start": 475.505,
        "end": 479.57
      }
    ],
    "num_words": 116,
    "start": 448.905,
    "end": 479.57
  },
  {
    "sentences": [
      {
        "text": "How do I find usually one marketing approach that can get me to that 100 customer mark?",
        "start": 479.71002,
        "end": 484.99002
      },
      {
        "text": "And usually this is done through experimentation.",
        "start": 484.99002,
        "end": 486.77002
      },
      {
        "text": "You look at the most common b to b SaaS marketing approaches, and you pick which one you think is most likely to work, and then you dive into it for a few months.",
        "start": 487.55002,
        "end": 495.835
      },
      {
        "text": "And you you give your give it your all, and whether that marketing approach, these are what I call the pillar b to b SaaS marketing approaches, you pick one of these.",
        "start": 495.835,
        "end": 503.79
      },
      {
        "text": "Usually, it's SEO or content or cold outreach, partnerships, integrations or pay per click ads.",
        "start": 503.95,
        "end": 509.23
      }
    ],
    "num_words": 105,
    "start": 479.71002,
    "end": 509.23
  },
  {
    "sentences": [
      {
        "text": "And those are the most common ones that I see people building into flywheels.",
        "start": 509.23,
        "end": 512.93
      },
      {
        "text": "Through all this, keep in mind there's a lot of experimentation and a lot of maybe going with your founder gut to get to the point where you have a 100 customers.",
        "start": 513.15,
        "end": 521.165
      },
      {
        "text": "It's harder than a lot of people make it out to be online.",
        "start": 521.225,
        "end": 525.00494
      },
      {
        "text": "And in fact, aside from building something people want and driving traffic to it and putting in all the hard work, there's one more thing that you're gonna need to retain customers.",
        "start": 525.14496,
        "end": 534.1
      },
      {
        "text": "I'll get to that in a minute.",
        "start": 534.24,
        "end": 535.2
      }
    ],
    "num_words": 98,
    "start": 509.23,
    "end": 535.2
  },
  {
    "sentences": [
      {
        "text": "But if you've enjoyed this video, if you've gotten value out of it, I'd love it if you'd hit that like button and subscribe to our channel.",
        "start": 535.2,
        "end": 540.88
      },
      {
        "text": "We have tons of videos like this coming out, whether it's pointed tactical advice like this video, live streams, conference talks.",
        "start": 540.88,
        "end": 548.03503
      },
      {
        "text": "We are putting out several videos per month all about the topic of building and growing successful SaaS products.",
        "start": 548.03503,
        "end": 553.635
      },
      {
        "text": "In terms of the one more thing you'll need to retain customers, I wanna say that finding a 100 customers is hard.",
        "start": 553.635,
        "end": 559.075
      },
      {
        "text": "Retaining them is a real challenge.",
        "start": 559.075,
        "end": 561.27997
      }
    ],
    "num_words": 95,
    "start": 535.2,
    "end": 561.27997
  },
  {
    "sentences": [
      {
        "text": "Because if you drive 10 new customers a month but you churn 10 customers a month, you'll be flat.",
        "start": 561.27997,
        "end": 565.92
      },
      {
        "text": "It doesn't matter if you find a 100 customers if you cannot retain them because building a product that people want and are willing to pay for month after month is much harder than you think.",
        "start": 565.92,
        "end": 575.035
      },
      {
        "text": "And while marketing is a challenge, just getting to that point where you have a product that people don't churn out of can take 6 months, 12 months, 18 months.",
        "start": 575.035,
        "end": 582.795
      },
      {
        "text": "So there's no formula.",
        "start": 582.795,
        "end": 583.855
      },
      {
        "text": "There's no direct map to getting from 0 to a 100 customers and retaining them.",
        "start": 583.915,
        "end": 588.1
      }
    ],
    "num_words": 104,
    "start": 561.27997,
    "end": 588.1
  },
  {
    "sentences": [
      {
        "text": "But hopefully, the ideas, strategies, and tactics that I presented in this video will help get you there.",
        "start": 588.1,
        "end": 593.72
      }
    ],
    "num_words": 18,
    "start": 588.1,
    "end": 593.72
  }
]
